benchmarks/k6/results/release-v1.1.0/broad-concurrency.stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/broad-concurrency.js
        output: -

     scenarios: (100.00%) 1 scenario, 75 max VUs, 1m20s max duration (incl. graceful stop):
              * broad_concurrency: Up to 75 looping VUs for 50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run                 [ 100% ] setup()
broad_concurrency   [   0% ]

Run                 [ 100% ] setup()
broad_concurrency   [   0% ]

running (0m03.0s), 02/75 VUs, 6 complete and 0 interrupted iterations
broad_concurrency   [   1% ] 02/75 VUs  00.6s/50.0s

running (0m04.0s), 06/75 VUs, 65 complete and 0 interrupted iterations
broad_concurrency   [   3% ] 06/75 VUs  01.6s/50.0s

running (0m05.0s), 10/75 VUs, 180 complete and 0 interrupted iterations
broad_concurrency   [   5% ] 10/75 VUs  02.6s/50.0s

running (0m06.0s), 13/75 VUs, 297 complete and 0 interrupted iterations
broad_concurrency   [   7% ] 13/75 VUs  03.6s/50.0s

running (0m07.0s), 17/75 VUs, 386 complete and 0 interrupted iterations
broad_concurrency   [   9% ] 17/75 VUs  04.6s/50.0s

running (0m08.0s), 21/75 VUs, 430 complete and 0 interrupted iterations
broad_concurrency   [  11% ] 21/75 VUs  05.6s/50.0s

running (0m09.0s), 25/75 VUs, 472 complete and 0 interrupted iterations
broad_concurrency   [  13% ] 25/75 VUs  06.6s/50.0s

running (0m10.0s), 29/75 VUs, 514 complete and 0 interrupted iterations
broad_concurrency   [  15% ] 29/75 VUs  07.6s/50.0s

running (0m11.0s), 32/75 VUs, 556 complete and 0 interrupted iterations
broad_concurrency   [  17% ] 32/75 VUs  08.6s/50.0s

running (0m12.0s), 36/75 VUs, 590 complete and 0 interrupted iterations
broad_concurrency   [  19% ] 36/75 VUs  09.6s/50.0s

running (0m13.0s), 40/75 VUs, 629 complete and 0 interrupted iterations
broad_concurrency   [  21% ] 40/75 VUs  10.6s/50.0s

running (0m14.0s), 44/75 VUs, 667 complete and 0 interrupted iterations
broad_concurrency   [  23% ] 44/75 VUs  11.6s/50.0s

running (0m15.0s), 47/75 VUs, 710 complete and 0 interrupted iterations
broad_concurrency   [  25% ] 47/75 VUs  12.6s/50.0s

running (0m16.0s), 51/75 VUs, 751 complete and 0 interrupted iterations
broad_concurrency   [  27% ] 51/75 VUs  13.6s/50.0s

running (0m17.0s), 55/75 VUs, 796 complete and 0 interrupted iterations
broad_concurrency   [  29% ] 55/75 VUs  14.6s/50.0s

running (0m18.0s), 58/75 VUs, 838 complete and 0 interrupted iterations
broad_concurrency   [  31% ] 58/75 VUs  15.6s/50.0s

running (0m19.0s), 62/75 VUs, 881 complete and 0 interrupted iterations
broad_concurrency   [  33% ] 62/75 VUs  16.6s/50.0s

running (0m20.0s), 66/75 VUs, 925 complete and 0 interrupted iterations
broad_concurrency   [  35% ] 66/75 VUs  17.6s/50.0s

running (0m21.0s), 69/75 VUs, 964 complete and 0 interrupted iterations
broad_concurrency   [  37% ] 69/75 VUs  18.6s/50.0s

running (0m22.0s), 73/75 VUs, 1000 complete and 0 interrupted iterations
broad_concurrency   [  39% ] 73/75 VUs  19.6s/50.0s

running (0m23.0s), 75/75 VUs, 1048 complete and 0 interrupted iterations
broad_concurrency   [  41% ] 75/75 VUs  20.6s/50.0s

running (0m24.0s), 75/75 VUs, 1081 complete and 0 interrupted iterations
broad_concurrency   [  43% ] 75/75 VUs  21.6s/50.0s

running (0m25.0s), 75/75 VUs, 1127 complete and 0 interrupted iterations
broad_concurrency   [  45% ] 75/75 VUs  22.6s/50.0s

running (0m26.0s), 75/75 VUs, 1168 complete and 0 interrupted iterations
broad_concurrency   [  47% ] 75/75 VUs  23.6s/50.0s

running (0m27.0s), 75/75 VUs, 1204 complete and 0 interrupted iterations
broad_concurrency   [  49% ] 75/75 VUs  24.6s/50.0s

running (0m28.0s), 75/75 VUs, 1247 complete and 0 interrupted iterations
broad_concurrency   [  51% ] 75/75 VUs  25.6s/50.0s

running (0m29.0s), 75/75 VUs, 1293 complete and 0 interrupted iterations
broad_concurrency   [  53% ] 75/75 VUs  26.6s/50.0s

running (0m30.0s), 75/75 VUs, 1330 complete and 0 interrupted iterations
broad_concurrency   [  55% ] 75/75 VUs  27.6s/50.0s

running (0m31.0s), 75/75 VUs, 1374 complete and 0 interrupted iterations
broad_concurrency   [  57% ] 75/75 VUs  28.6s/50.0s

running (0m32.0s), 75/75 VUs, 1413 complete and 0 interrupted iterations
broad_concurrency   [  59% ] 75/75 VUs  29.6s/50.0s

running (0m33.0s), 75/75 VUs, 1449 complete and 0 interrupted iterations
broad_concurrency   [  61% ] 75/75 VUs  30.6s/50.0s

running (0m34.0s), 75/75 VUs, 1493 complete and 0 interrupted iterations
broad_concurrency   [  63% ] 75/75 VUs  31.6s/50.0s

running (0m35.0s), 75/75 VUs, 1533 complete and 0 interrupted iterations
broad_concurrency   [  65% ] 75/75 VUs  32.6s/50.0s

running (0m36.0s), 75/75 VUs, 1568 complete and 0 interrupted iterations
broad_concurrency   [  67% ] 75/75 VUs  33.6s/50.0s

running (0m37.0s), 75/75 VUs, 1606 complete and 0 interrupted iterations
broad_concurrency   [  69% ] 75/75 VUs  34.6s/50.0s

running (0m38.0s), 75/75 VUs, 1648 complete and 0 interrupted iterations
broad_concurrency   [  71% ] 75/75 VUs  35.6s/50.0s

running (0m39.0s), 75/75 VUs, 1683 complete and 0 interrupted iterations
broad_concurrency   [  73% ] 75/75 VUs  36.6s/50.0s

running (0m40.0s), 75/75 VUs, 1722 complete and 0 interrupted iterations
broad_concurrency   [  75% ] 75/75 VUs  37.6s/50.0s

running (0m41.0s), 75/75 VUs, 1765 complete and 0 interrupted iterations
broad_concurrency   [  77% ] 75/75 VUs  38.6s/50.0s

running (0m42.0s), 75/75 VUs, 1803 complete and 0 interrupted iterations
broad_concurrency   [  79% ] 75/75 VUs  39.6s/50.0s

running (0m43.0s), 74/75 VUs, 1839 complete and 0 interrupted iterations
broad_concurrency   [  81% ] 74/75 VUs  40.6s/50.0s

running (0m44.0s), 70/75 VUs, 1874 complete and 0 interrupted iterations
broad_concurrency   [  83% ] 70/75 VUs  41.6s/50.0s

running (0m45.0s), 63/75 VUs, 1916 complete and 0 interrupted iterations
broad_concurrency   [  85% ] 63/75 VUs  42.6s/50.0s

running (0m46.0s), 58/75 VUs, 1953 complete and 0 interrupted iterations
broad_concurrency   [  87% ] 58/75 VUs  43.6s/50.0s

running (0m47.0s), 49/75 VUs, 1996 complete and 0 interrupted iterations
broad_concurrency   [  89% ] 49/75 VUs  44.6s/50.0s

running (0m48.0s), 40/75 VUs, 2037 complete and 0 interrupted iterations
broad_concurrency   [  91% ] 40/75 VUs  45.6s/50.0s

running (0m49.0s), 32/75 VUs, 2079 complete and 0 interrupted iterations
broad_concurrency   [  93% ] 32/75 VUs  46.6s/50.0s

running (0m50.0s), 22/75 VUs, 2123 complete and 0 interrupted iterations
broad_concurrency   [  95% ] 22/75 VUs  47.6s/50.0s

running (0m51.0s), 12/75 VUs, 2182 complete and 0 interrupted iterations
broad_concurrency   [  97% ] 12/75 VUs  48.6s/50.0s

running (0m52.0s), 03/75 VUs, 2271 complete and 0 interrupted iterations
broad_concurrency   [  99% ] 03/75 VUs  49.6s/50.0s
time="2026-08-17T18:28:11+05:30" level=info msg="[broad-concurrency] completed: 4159 -> 5949 (retries: 25525 -> 37164, exhausted: 926 -> 1420)" source=console


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.02' rate=17.10%


  █ TOTAL RESULTS 

    checks_total.......: 2888    55.161537/s
    checks_succeeded...: 100.00% 2888 out of 2888
    checks_failed......: 0.00%   0 out of 2888

    ✓ principal created (201)
    ✓ api key issued (201)
    ✓ account created (201)
    ✓ funded (201)
    ✓ metrics ok (200)
    ✓ transfer succeeded or bounded-retry-exhausted

    HTTP
    http_req_duration..............: avg=886.93ms min=260µs   med=541.46ms max=3.24s p(90)=2.71s p(95)=2.92s
      { expected_response:true }...: avg=594.79ms min=260µs   med=260.18ms max=3.16s p(90)=1.77s p(95)=2.31s
    http_req_failed................: 17.10% 494 out of 2888
    http_reqs......................: 2888   55.161537/s

    EXECUTION
    iteration_duration.............: avg=1.17s    min=56.76ms med=904.15ms max=3.29s p(90)=2.87s p(95)=2.99s
    iterations.....................: 2284   43.624983/s
    vus............................: 3      min=0           max=75
    vus_max........................: 75     min=75          max=75

    NETWORK
    data_received..................: 1.3 MB 25 kB/s
    data_sent......................: 1.1 MB 21 kB/s



running (0m52.4s), 00/75 VUs, 2284 complete and 0 interrupted iterations
broad_concurrency ✓ [ 100% ] 00/75 VUs  50s
time="2026-08-17T18:28:11+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"