benchmarks/k6/results/release-v1.1.0/hot-account-contention.stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/hot-account-contention.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 50s max duration (incl. graceful stop):
              * hot_account_contention: 30 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 30/30 VUs, 120 complete and 0 interrupted iterations
hot_account_contention   [   5% ] 30 VUs  01.0s/20s

running (02.0s), 30/30 VUs, 264 complete and 0 interrupted iterations
hot_account_contention   [  10% ] 30 VUs  02.0s/20s

running (03.0s), 30/30 VUs, 406 complete and 0 interrupted iterations
hot_account_contention   [  15% ] 30 VUs  03.0s/20s

running (04.0s), 30/30 VUs, 529 complete and 0 interrupted iterations
hot_account_contention   [  20% ] 30 VUs  04.0s/20s

running (05.0s), 30/30 VUs, 673 complete and 0 interrupted iterations
hot_account_contention   [  25% ] 30 VUs  05.0s/20s

running (06.0s), 30/30 VUs, 820 complete and 0 interrupted iterations
hot_account_contention   [  30% ] 30 VUs  06.0s/20s

running (07.0s), 30/30 VUs, 972 complete and 0 interrupted iterations
hot_account_contention   [  35% ] 30 VUs  07.0s/20s

running (08.0s), 30/30 VUs, 1113 complete and 0 interrupted iterations
hot_account_contention   [  40% ] 30 VUs  08.0s/20s

running (09.0s), 30/30 VUs, 1258 complete and 0 interrupted iterations
hot_account_contention   [  45% ] 30 VUs  09.0s/20s

running (10.0s), 30/30 VUs, 1396 complete and 0 interrupted iterations
hot_account_contention   [  50% ] 30 VUs  10.0s/20s

running (11.0s), 30/30 VUs, 1527 complete and 0 interrupted iterations
hot_account_contention   [  55% ] 30 VUs  11.0s/20s

running (12.0s), 30/30 VUs, 1667 complete and 0 interrupted iterations
hot_account_contention   [  60% ] 30 VUs  12.0s/20s

running (13.0s), 30/30 VUs, 1790 complete and 0 interrupted iterations
hot_account_contention   [  65% ] 30 VUs  13.0s/20s

running (14.0s), 30/30 VUs, 1915 complete and 0 interrupted iterations
hot_account_contention   [  70% ] 30 VUs  14.0s/20s

running (15.0s), 30/30 VUs, 2056 complete and 0 interrupted iterations
hot_account_contention   [  75% ] 30 VUs  15.0s/20s

running (16.0s), 30/30 VUs, 2198 complete and 0 interrupted iterations
hot_account_contention   [  80% ] 30 VUs  16.0s/20s

running (17.0s), 30/30 VUs, 2335 complete and 0 interrupted iterations
hot_account_contention   [  85% ] 30 VUs  17.0s/20s

running (18.0s), 30/30 VUs, 2477 complete and 0 interrupted iterations
hot_account_contention   [  90% ] 30 VUs  18.0s/20s

running (19.0s), 30/30 VUs, 2613 complete and 0 interrupted iterations
hot_account_contention   [  95% ] 30 VUs  19.0s/20s

running (20.0s), 30/30 VUs, 2754 complete and 0 interrupted iterations
hot_account_contention   [ 100% ] 30 VUs  20.0s/20s
time="2026-08-17T18:27:18+05:30" level=info msg="[hot-account-contention] completed: 2064 -> 4159 (retries: 8965 -> 25525, exhausted: 231 -> 926)" source=console
time="2026-08-17T18:27:18+05:30" level=info msg="[hot-account-contention] final balance a3719a79-d66a-4b12-b1d3-88ff76f03389 = 100000420" source=console
time="2026-08-17T18:27:18+05:30" level=info msg="[hot-account-contention] final balance 7022806d-60b4-41d2-a327-4bdaef891126 = 99999680" source=console
time="2026-08-17T18:27:18+05:30" level=info msg="[hot-account-contention] final balance 9e6173f0-a9c1-4b3a-a1ae-379c7cd2b65a = 99999900" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=430.4ms


  █ TOTAL RESULTS 

    checks_total.......: 2800    138.194148/s
    checks_succeeded...: 100.00% 2800 out of 2800
    checks_failed......: 0.00%   0 out of 2800

    ✓ principal created (201)
    ✓ api key issued (201)
    ✓ account created (201)
    ✓ funded (201)
    ✓ metrics ok (200)
    ✓ transfer succeeded or bounded-retry-exhausted

    HTTP
    http_req_duration..............: avg=194.67ms min=294µs   med=144.94ms max=618.75ms p(90)=407.82ms p(95)=430.4ms 
      { expected_response:true }...: avg=126.72ms min=294µs   med=68.48ms  max=560.27ms p(90)=326.54ms p(95)=374.67ms
    http_req_failed................: 24.79% 695 out of 2803
    http_reqs......................: 2803   138.342213/s

    EXECUTION
    iteration_duration.............: avg=216.04ms min=29.01ms med=168.79ms max=639.3ms  p(90)=428.29ms p(95)=451.16ms
    iterations.....................: 2790   137.700597/s
    vus............................: 30     min=30          max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 1.3 MB 64 kB/s
    data_sent......................: 1.2 MB 58 kB/s



running (20.3s), 00/30 VUs, 2790 complete and 0 interrupted iterations
hot_account_contention ✓ [ 100% ] 30 VUs  20s